package main

import (
	"bytes"
	"log"
	"net/http"

	"io/ioutil"

	"github.com/gin-gonic/gin/json"
)

type ScheduleType int

const (
	GroupMatches       ScheduleType = 0 // 小组赛
	RoundEight                          // 八强赛
	FinalFour                           // 四强赛
	Semifinal                           // 半决赛
	MatchForThirdPlace                  // 季军赛
	Finals                              // 总决赛
)

type ScheduleStatus int

const (
	HomeTeamWin ScheduleStatus = 0 // 主队胜利
	AwayTeamWin                    // 客队胜利
	Draw                           // 平局
)

type NewScheduleReq struct {
	HomeTeam        string       `json:"home_team"`          // 主队
	AwayTeam        string       `json:"away_team"`          // 客队
	HomeTeamWinOdds float64      `json:"home_team_win_odds"` // 主队胜利的赔率
	AwayTeamWinOdds float64      `json:"away_team_win_odds"` // 客队胜利的赔率
	TiedOdds        float64      `json:"tied_odds"`          // 平局的赔率
	ScheduleTime    string       `json:"schedule_time"`      // 比赛时间
	ScheduleGroup   string       `json:"schedule_group"`     // 比赛组别
	ScheduleType    ScheduleType `json:"schedule_type"`      // 比赛类别
	DisableBetting  bool         `json:"disable_betting"`    // 是否允许投注
	EnableDisplay   bool         `json:"enable_dispaly"`     // 是否显示在投注页
}

var schedules = []NewScheduleReq{
	{
		"俄罗斯", "沙特阿拉伯",
		1.233, 2.345, 2.345,
		"2018-06-14 23:00:00", "A", 0, false, true,
	},
	{
		"埃及", "乌拉圭",
		1.233, 2.345, 2.345,
		"2018-06-15 20:00:00", "A", 0, false, true,
	},
	{
		"摩洛哥", "伊朗",
		1.233, 2.345, 2.345,
		"2018-06-15 23:00:00", "B", 0, false, true,
	},
	{
		"葡萄牙", "西班牙",
		1.233, 2.345, 2.345,
		"2018-06-16 02:00:00", "B", 0, false, true,
	},
	{
		"法国", "澳大利亚",
		1.233, 2.345, 2.345,
		"2018-06-16 18:00:00", "C", 0, false, true,
	},
	{
		"阿根廷", "冰岛",
		1.233, 2.345, 2.345,
		"2018-06-16 21:00:00", "D", 0, false, true,
	},
	{
		"秘鲁", "丹麦",
		1.233, 2.345, 2.345,
		"2018-06-17 00:00:00", "C", 0, false, true,
	},
	{
		"克罗地亚", "尼日利亚",
		1.233, 2.345, 2.345,
		"2018-06-17 03:00:00", "D", 0, false, true,
	},
	{
		"哥斯达黎加", "塞尔维亚",
		1.233, 2.345, 2.345,
		"2018-06-17 20:00:00", "E", 0, false, true,
	},
	{
		"德国", "墨西哥",
		1.233, 2.345, 2.345,
		"2018-06-17 23:00:00", "F", 0, false, true,
	},
	{
		"巴西", "瑞士",
		1.233, 2.345, 2.345,
		"2018-06-18 02:00:00", "E", 0, false, true,
	},
	{
		"瑞典", "韩国",
		1.233, 2.345, 2.345,
		"2018-06-18 20:00:00", "F", 0, false, true,
	},
	{
		"比利时", "巴拿马",
		1.233, 2.345, 2.345,
		"2018-06-18 23:00:00", "G", 0, false, true,
	},
	{
		"突尼斯", "英格兰",
		1.233, 2.345, 2.345,
		"2018-06-19 02:00:00", "G", 0, false, true,
	},
	{
		"哥伦比亚", "日本",
		1.233, 2.345, 2.345,
		"2018-06-19 20:00:00", "H", 0, false, true,
	},
	{
		"波兰", "塞内加尔",
		1.233, 2.345, 2.345,
		"2018-06-19 23:00:00", "H", 0, false, true,
	},
	{
		"俄罗斯", "埃及",
		1.233, 2.345, 2.345,
		"2018-06-20 02:00:00", "A", 0, false, true,
	},
	{
		"葡萄牙", "摩洛哥",
		1.233, 2.345, 2.345,
		"2018-06-20 20:00:00", "B", 0, false, true,
	},
	{
		"乌拉圭", "沙特阿拉伯",
		1.233, 2.345, 2.345,
		"2018-06-20 23:00:00", "A", 0, false, true,
	},
	{
		"伊朗", "西班牙",
		1.233, 2.345, 2.345,
		"2018-06-21 02:00:00", "B", 0, false, true,
	},
	{
		"丹麦", "澳大利亚",
		1.233, 2.345, 2.345,
		"2018-06-21 20:00:00", "C", 0, false, true,
	},
	{
		"法国", "秘鲁",
		1.233, 2.345, 2.345,
		"2018-06-21 23:00:00", "C", 0, false, true,
	},
	{
		"阿根廷", "克罗地亚",
		1.233, 2.345, 2.345,
		"2018-06-22 02:00:00", "D", 0, false, true,
	},
	{
		"巴西", "哥斯达黎加",
		1.233, 2.345, 2.345,
		"2018-06-22 20:00:00", "E", 0, false, true,
	},
	{
		"尼日利亚", "冰岛",
		1.233, 2.345, 2.345,
		"2018-06-22 23:00:00", "D", 0, false, true,
	},
	{
		"塞尔维亚", "瑞士",
		1.233, 2.345, 2.345,
		"2018-06-23 02:00:00", "E", 0, false, true,
	},
	{
		"比利时", "突尼斯",
		1.233, 2.345, 2.345,
		"2018-06-23 20:00:00", "G", 0, false, true,
	},
	{
		"韩国", "墨西哥",
		1.233, 2.345, 2.345,
		"2018-06-23 23:00:00", "F", 0, false, true,
	},
	{
		"德国", "瑞典",
		1.233, 2.345, 2.345,
		"2018-06-24 02:00:00", "F", 0, false, true,
	},
	{
		"英格兰", "巴拿马",
		1.233, 2.345, 2.345,
		"2018-06-24 20:00:00", "G", 0, false, true,
	},
	{
		"日本", "塞内加尔",
		1.233, 2.345, 2.345,
		"2018-06-24 23:00:00", "H", 0, false, true,
	},
	{
		"波兰", "哥伦比亚",
		1.233, 2.345, 2.345,
		"2018-06-25 02:00:00", "H", 0, false, true,
	},
	{
		"沙特阿拉伯", "埃及",
		1.233, 2.345, 2.345,
		"2018-06-25 22:00:00", "A", 0, false, true,
	},
	{
		"俄罗斯", "乌拉圭",
		1.233, 2.345, 2.345,
		"2018-06-25 22:00:00", "A", 0, false, true,
	},
	{
		"西班牙", "摩洛哥",
		1.233, 2.345, 2.345,
		"2018-06-26 02:00:00", "B", 0, false, true,
	},
	{
		"伊朗", "葡萄牙",
		1.233, 2.345, 2.345,
		"2018-06-26 02:00:00", "B", 0, false, true,
	},
	{
		"丹麦", "法国",
		1.233, 2.345, 2.345,
		"2018-06-26 22:00:00", "C", 0, false, true,
	},
	{
		"澳大利亚", "秘鲁",
		1.233, 2.345, 2.345,
		"2018-06-26 22:00:00", "C", 0, false, true,
	},
	{
		"冰岛", "克罗地亚",
		1.233, 2.345, 2.345,
		"2018-06-27 02:00:00", "D", 0, false, true,
	},
	{
		"尼日利亚", "阿根廷",
		1.233, 2.345, 2.345,
		"2018-06-27 02:00:00", "D", 0, false, true,
	},
	{
		"墨西哥", "瑞典",
		1.233, 2.345, 2.345,
		"2018-06-27 22:00:00", "F", 0, false, true,
	},
	{
		"韩国", "德国",
		1.233, 2.345, 2.345,
		"2018-06-27 22:00:00", "F", 0, false, true,
	},
	{
		"塞尔维亚", "巴西",
		1.233, 2.345, 2.345,
		"2018-06-28 02:00:00", "E", 0, false, true,
	},
	{
		"瑞士", "哥斯达黎加",
		1.233, 2.345, 2.345,
		"2018-06-28 02:00:00", "E", 0, false, true,
	},
	{
		"塞内加尔", "哥伦比亚",
		1.233, 2.345, 2.345,
		"2018-06-28 22:00:00", "H", 0, false, true,
	},
	{
		"日本", "波兰",
		1.233, 2.345, 2.345,
		"2018-06-28 22:00:00", "H", 0, false, true,
	},
	{
		"英格兰", "比利时",
		1.233, 2.345, 2.345,
		"2018-06-29 02:00:00", "G", 0, false, true,
	},
	{
		"巴拿马", "突尼斯",
		1.233, 2.345, 2.345,
		"2018-06-29 02:00:00", "G", 0, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-06-30 22:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-01 02:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-01 22:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-02 02:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-02 22:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-03 02:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-03 22:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-04 02:00:00", "X", 1, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-06 22:00:00", "X", 2, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-07 02:00:00", "X", 2, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-07 22:00:00", "X", 2, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-08 02:00:00", "X", 2, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-11 02:00:00", "X", 3, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-12 02:00:00", "X", 3, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-14 22:00:00", "X", 4, false, true,
	},
	{
		"待定", "待定",
		1.233, 2.345, 2.345,
		"2018-07-15 23:00:00", "X", 5, false, true,
	},
}

const (
	reqURL = "http://z3.zhengyinyong.com:9614/new_schedule"
)

func main() {
	for _, schedule := range schedules {
		jsonData, err := json.Marshal(schedule)
		if err != nil {
			log.Fatalf("json marshal error: %v\n", err)
		}
		req, err := http.NewRequest("PUT", reqURL, bytes.NewBuffer(jsonData))
		req.Header.Set("Content-Type", "application/json")
		client := &http.Client{}
		resp, err := client.Do(req)
		defer resp.Body.Close()

		body, _ := ioutil.ReadAll(resp.Body)
		if err != nil {
			log.Fatalf("do post request failed, error: %v, body: %v\n", err, body)
		}
	}
}
